import streamlit as st

st.title("🍽️ MealMatch - มื้อไหนดี?")

# ตัวเลือกต่าง ๆ
location = st.selectbox("บริเวณที่ต้องการจะไป", ["ประตู 1","ประตู 2","ประตู 3","ประตู 4"])
choice = st.selectbox("เลือกประเภทอาหาร", ["อาหารตามสั่ง", "อาหารอีสาน (เช่น ส้มตำ ลาบ ก้อย)", "อาหารจานเดียว", "ปิ้งย่าง", "อาหารเกาหลี", "อาหารญี่ปุ่น"])
budget = st.radio("งบประมาณต่อมื้อ (บาท)", ["ไม่เกิน 50", "50 - 100", "100 - 200", "200+"])
time = st.selectbox("เวลาที่มักออกไปกิน", ["เช้า", "กลางวัน", "เย็น"])

if st.button("ค้นหาร้านอาหาร"):
    st.success(f"แนะนำร้านอาหารบริเวณ \"{location}\" ประเภท \"{choice}\" ในช่วง \"{time}\" ที่อยู่ในงบ \"{budget}\" 👍")
